/*
   Файл               : StdAfx.h

   Проект             : любой проект, использующий станартные
                        функции API-SDK

   Назначение         : стандартный включаемый файл для
                        прекомпиляции (результаты компиляции в
                        папке Debug в файле .PCH)
    
   Microsoft Visual Studio C++ .NET 2005
*/

// Предотвращение возможности многократного подключения данного
//   файла
#ifndef _StdAfx_h
    #define _StdAfx_h

    // Здесь следует подключить все стандартные (неизменяемые)
    //   заголовочные файлы большого размера

    // Заголовочный файл для низкоуровневых Windows-приложений
    #include <windows.h>

#endif
